src/Catalogs/ДанныеАвтозаполненияПлатежей/ДанныеАвтозаполненияПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДанныеАвтозаполненияПлатежей</name>
  <attributes>
    <name>КатегорияДвижения</name>
    <type>
      <types>EnumRef.КатегорииДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНазначенияПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияОперации</name>
    <type>
      <types>CatalogRef.КатегорииОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмВычисления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УправленческийУчет</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПараметра</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмВычисления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретРедактирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Необязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ДанныеАвтозаполненияПлатежей/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура УправленческийУчетАлгоритмВычисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.УправленческийУчет.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьФорму("Справочник.ДанныеАвтозаполненияПлатежей.Форма.ФормаРедактированияАлгоритма", 
						Новый Структура("АлгоритмВычисления", ТекущиеДанные.АлгоритмВычисления),
						ЭтотОбъект,,,,
						Новый ОписаниеОповещения("УправленческийУчетАлгоритмВычисленияНачалоВыбораЗавершение", ЭтотОбъект),
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправленческийУчетАлгоритмВычисленияНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Элементы.УправленческийУчет.ТекущиеДанные.АлгоритмВычисления = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	
	Объект.ШаблонНазначенияПлатежа = СокрЛП(Объект.ШаблонНазначенияПлатежа);
	Объект.ШаблонНазначенияПлатежа = нрег(Объект.ШаблонНазначенияПлатежа);
	Объект.ШаблонНазначенияПлатежа = СтрЗаменить(Объект.ШаблонНазначенияПлатежа, "  ", " ");
	Объект.ШаблонНазначенияПлатежа = СтрЗаменить(Объект.ШаблонНазначенияПлатежа, "\", "\\");
	Объект.ШаблонНазначенияПлатежа = СтрЗаменить(Объект.ШаблонНазначенияПлатежа, "/", "\/");
	Объект.ШаблонНазначенияПлатежа = СтрЗаменить(Объект.ШаблонНазначенияПлатежа, "(", "\(");
	Объект.ШаблонНазначенияПлатежа = СтрЗаменить(Объект.ШаблонНазначенияПлатежа, ")", "\)");
	Объект.ШаблонНазначенияПлатежа = СтрЗаменить(Объект.ШаблонНазначенияПлатежа, " ", "\s+");
	
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмВычисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.ДанныеАвтозаполненияПлатежей.Форма.ФормаРедактированияАлгоритма", 
						Новый Структура("АлгоритмВычисления", Объект.АлгоритмВычисления),
						ЭтотОбъект,,,,
						Новый ОписаниеОповещения("АлгоритмВычисленияНачалоВыбораЗавершение", ЭтотОбъект),
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
					
КонецПроцедуры
					
&НаКлиенте
Процедура АлгоритмВычисленияНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Объект.АлгоритмВычисления = Результат;
	КонецЕсли;
	
КонецПроцедуры					

&НаСервере
Процедура КатегорияОперацииПриИзмененииНаСервере()
	
	Объект.УправленческийУчет.Очистить();
	
	Если ЗначениеЗаполнено(Объект.КатегорияОперации) Тогда
		
		Для Каждого СтруктураДанных Из УправленческийУчетСервер.ПодготовитьДанныеУправленческогоУчета(Объект.КатегорияОперации) Цикл
			
			НоваяСтрока = Объект.УправленческийУчет.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных,, "Значение");
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияОперацииПриИзменении(Элемент)
	КатегорияОперацииПриИзмененииНаСервере();
КонецПроцедуры
